tristar-multicopters/MotorControl/src/GNR2_Firmware/revA/grn2_ra6t2/ra_gen/hal_data.c
                                  #if ((1) == 8)
                                      &virtual_channel_1_cfg,
                                  #endif

                                  #if ((0) == 8)
                                      &virtual_channel_2_cfg,
                                  #endif

                                  #if ((0) == 8)
                                      &virtual_channel_3_cfg,
                                  #endif

                                  #if ((0) == 8)
                                      &virtual_channel_4_cfg,
                                  #endif

                                  #if ((0) == 8)
                                      &virtual_channel_5_cfg,
                                  #endif

                                  #if ((0) == 8)
                                      &virtual_channel_6_cfg,
                                  #endif

                                  #if ((0) == 8)
                                      &virtual_channel_7_cfg,
                                  #endif

                                  #if ((0) == 8)
                                      &virtual_channel_8_cfg,
                                  #endif

                                  #if ((0) == 8)
                                      &virtual_channel_9_cfg,
                                  #endif

                                  #if ((0) == 8)
                                      &virtual_channel_10_cfg,
                                  #endif

                                  #if ((0) == 8)
                                      &virtual_channel_11_cfg,
                                  #endif

                                  #if ((0) == 8)
                                      &virtual_channel_12_cfg,
                                  #endif

                                  #if ((0) == 8)
                                      &virtual_channel_13_cfg,
                                  #endif

                                  #if ((0) == 8)
                                      &virtual_channel_14_cfg,
                                  #endif

                                  #if ((0) == 8)
                                      &virtual_channel_15_cfg,
                                  #endif

                                  #if ((0) == 8)
                                      &virtual_channel_16_cfg,
                                  #endif

                                  #if ((0) == 8)
                                      &virtual_channel_17_cfg,
                                  #endif

                                  #if ((0) == 8)
                                      &virtual_channel_18_cfg,
                                  #endif

                                  #if ((0) == 8)
                                      &virtual_channel_19_cfg,
                                  #endif

                                  #if ((0) == 8)
                                      &virtual_channel_20_cfg,
                                  #endif

                                  #if ((0) == 8)
                                      &virtual_channel_21_cfg,
                                  #endif

                                  #if ((0) == 8)
                                      &virtual_channel_22_cfg,
                                  #endif

                                  #if ((0) == 8)
                                      &virtual_channel_23_cfg,
                                  #endif

                                  #if ((0) == 8)
                                      &virtual_channel_24_cfg,
                                  #endif

                                  #if ((0) == 8)
                                      &virtual_channel_25_cfg,
                                  #endif

                                  #if ((0) == 8)
                                      &virtual_channel_26_cfg,
                                  #endif

                                  #if ((0) == 8)
                                      &virtual_channel_27_cfg,
                                  #endif

                                  #if ((0) == 8)
                                      &virtual_channel_28_cfg,
                                  #endif

                                  #if ((0) == 8)
                                      &virtual_channel_29_cfg,
                                  #endif

                                  #if ((0) == 8)
                                      &virtual_channel_30_cfg,
                                  #endif

                                  #if ((0) == 8)
                                      &virtual_channel_31_cfg,
                                  #endif

                                  #if ((0) == 8)
                                      &virtual_channel_32_cfg,
                                  #endif

                                  #if ((0) == 8)
                                      &virtual_channel_33_cfg,
                                  #endif

                                  #if ((0) == 8)
                                      &virtual_channel_34_cfg,
                                  #endif

                                  #if ((0) == 8)
                                      &virtual_channel_35_cfg,
                                  #endif

                                  #if ((0) == 8)
                                      &virtual_channel_36_cfg,
                                  #endif
                                  };
                                  #endif
#if (((1) == 9)||((1) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9)||((0) == 9))
const adc_b_virtual_channel_cfg_t *const group_8_virtual_channels[] = {
                                  #if ((1) == 9)
                                      &virtual_channel_0_cfg,
                                  #endif

                                  #if ((1) == 9)
                                      &virtual_channel_1_cfg,
                                  #endif

                                  #if ((0) == 9)
                                      &virtual_channel_2_cfg,
                                  #endif

                                  #if ((0) == 9)
                                      &virtual_channel_3_cfg,
                                  #endif

                                  #if ((0) == 9)
                                      &virtual_channel_4_cfg,
                                  #endif

                                  #if ((0) == 9)
                                      &virtual_channel_5_cfg,
                                  #endif

                                  #if ((0) == 9)
                                      &virtual_channel_6_cfg,
                                  #endif

                                  #if ((0) == 9)
                                      &virtual_channel_7_cfg,
                                  #endif

                                  #if ((0) == 9)
                                      &virtual_channel_8_cfg,
                                  #endif

                                  #if ((0) == 9)
                                      &virtual_channel_9_cfg,
                                  #endif

                                  #if ((0) == 9)
                                      &virtual_channel_10_cfg,
                                  #endif

                                  #if ((0) == 9)
                                      &virtual_channel_11_cfg,
                                  #endif

                                  #if ((0) == 9)
                                      &virtual_channel_12_cfg,
                                  #endif

                                  #if ((0) == 9)
                                      &virtual_channel_13_cfg,
                                  #endif

                                  #if ((0) == 9)
                                      &virtual_channel_14_cfg,
                                  #endif

                                  #if ((0) == 9)
                                      &virtual_channel_15_cfg,
                                  #endif

                                  #if ((0) == 9)
                                      &virtual_channel_16_cfg,
                                  #endif

                                  #if ((0) == 9)
                                      &virtual_channel_17_cfg,
                                  #endif

                                  #if ((0) == 9)
                                      &virtual_channel_18_cfg,
                                  #endif

                                  #if ((0) == 9)
                                      &virtual_channel_19_cfg,
                                  #endif

                                  #if ((0) == 9)
                                      &virtual_channel_20_cfg,
                                  #endif

                                  #if ((0) == 9)
                                      &virtual_channel_21_cfg,
                                  #endif

                                  #if ((0) == 9)
                                      &virtual_channel_22_cfg,
                                  #endif

                                  #if ((0) == 9)
                                      &virtual_channel_23_cfg,
                                  #endif

                                  #if ((0) == 9)
                                      &virtual_channel_24_cfg,
                                  #endif

                                  #if ((0) == 9)
                                      &virtual_channel_25_cfg,
                                  #endif

                                  #if ((0) == 9)
                                      &virtual_channel_26_cfg,
                                  #endif

                                  #if ((0) == 9)
                                      &virtual_channel_27_cfg,
                                  #endif

                                  #if ((0) == 9)
                                      &virtual_channel_28_cfg,
                                  #endif

                                  #if ((0) == 9)
                                      &virtual_channel_29_cfg,
                                  #endif

                                  #if ((0) == 9)
                                      &virtual_channel_30_cfg,
                                  #endif

                                  #if ((0) == 9)
                                      &virtual_channel_31_cfg,
                                  #endif

                                  #if ((0) == 9)
                                      &virtual_channel_32_cfg,
                                  #endif

                                  #if ((0) == 9)
                                      &virtual_channel_33_cfg,
                                  #endif

                                  #if ((0) == 9)
                                      &virtual_channel_34_cfg,
                                  #endif

                                  #if ((0) == 9)
                                      &virtual_channel_35_cfg,
                                  #endif

                                  #if ((0) == 9)
                                      &virtual_channel_36_cfg,
                                  #endif
                                  };
                                  #endif

                     #if (1) // Define Scan Group 0 if it's enabled
                     const adc_b_group_cfg_t adc_b_group_0_cfg =
                     {
                         .scan_group_id                   = ADC_GROUP_ID_0,
                         .converter_selection             = (0),
                         .scan_group_enable               = (1),
                         .scan_end_interrupt_enable       = (1),
                         .external_trigger_enable_mask    = ( ADC_B_EXTERNAL_TRIGGER_NONE),
                         .elc_trigger_enable_mask         = ( 0x00),
                         .gpt_trigger_enable_mask         = (0x10 |  ADC_B_GPT_TRIGGER_NONE),

